/************************************************************************
* 模块名称：四位共阳极数码管驱动模块
* 文件名  ：BSP_LED_SEG.h
* 说明    ：头文件，提供自定义数据类型及外部调用的接口函数
* 版 本 号：V1.0
* 修改记录：
*		    版本号       日期        作者                 
*		    V1.0     2022-10-3     yan xuewen         
***********************************************************************/
#ifndef __BSP_SEG_H
#define __BSP_SEG_H
/***************************************************************
                        本模块包含的头文件
***************************************************************/
#include "stm32f4xx_hal.h"
/**********************************************************************
                     本模块的宏定义
**********************************************************************/
//两位阳极管脚定义
#define  DIG1_Pin          GPIO_PIN_14
#define  DIG1_GPIO_Port    GPIOB
#define  DIG2_Pin          GPIO_PIN_15
#define  DIG2_GPIO_Port    GPIOB

//段码输出管脚定义
#define  MOSI_PIN         GPIO_PIN_3
#define  MOSI_GPIO_Port    GPIOC
#define  SCK_PIN         GPIO_PIN_13
#define  SCK_GPIO_Port    GPIOB
#define  RCK_PIN          GPIO_PIN_9
#define  RCK_GPIO_Port    GPIOC
/*********************************************************************
                     本模块提供给外部调用的函数
**********************************************************************/
void BSP_LEDSEG_ShowNum(uint8_t , uint8_t );
#endif
